nxp-appcodehub/an-mcxa346-spi-interface-implemented-by-smartdma/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins_SmartDMA
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPIPins_SmartDMA(void)
{
    /* GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* GPIO4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO4);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* PORT4: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT4);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* GPIO4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO4_RST_SHIFT_RSTn);
    /* LPSPI1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPSPI1_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /* PORT4 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT4_RST_SHIFT_RSTn);

    gpio_pin_config_t SENSOR_INT1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin 91)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SMARTDMA_SENSOR_INT1_GPIO, BOARD_INITSPIPINS_SMARTDMA_SENSOR_INT1_PIN, &SENSOR_INT1_config);

    gpio_pin_config_t SENSOR_INT2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_3 (pin 24)  */
    GPIO_PinInit(BOARD_INITSPIPINS_SMARTDMA_SENSOR_INT2_GPIO, BOARD_INITSPIPINS_SMARTDMA_SENSOR_INT2_PIN, &SENSOR_INT2_config);

    /* PORT3_10 (pin 96) is configured as SmartDMA_PIO10 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_MISO_PORT, BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_MISO_PIN, kPORT_MuxAlt10);

    PORT3->PCR[10] = ((PORT3->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

                      /* Pull Enable: Enables. */
                      | PORT_PCR_PE(PCR_PE_pe1)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_11 (pin 95) is configured as SmartDMA_PIO11 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_CS_PORT, BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_CS_PIN, kPORT_MuxAlt10);

    PORT3->PCR[11] = ((PORT3->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

                      /* Pull Select: Enables internal pullup resistor. */
                      | PORT_PCR_PS(PCR_PS_ps1)

                      /* Pull Enable: Enables. */
                      | PORT_PCR_PE(PCR_PE_pe1)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin 91) is configured as P3_13 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SMARTDMA_SENSOR_INT1_PORT, BOARD_INITSPIPINS_SMARTDMA_SENSOR_INT1_PIN, kPORT_MuxAlt0);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_8 (pin 98) is configured as SmartDMA_PIO8 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_SCK_PORT, BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_SCK_PIN, kPORT_MuxAlt10);

    PORT3->PCR[8] = ((PORT3->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

                     /* Pull Enable: Enables. */
                     | PORT_PCR_PE(PCR_PE_pe1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_9 (pin 97) is configured as SmartDMA_PIO9 */
    PORT_SetPinMux(BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_MOSI_PORT, BOARD_INITSPIPINS_SMARTDMA_SMDMA_SPI_MOSI_PIN, kPORT_MuxAlt10);

    PORT3->PCR[9] = ((PORT3->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

                     /* Pull Enable: Enables. */
                     | PORT_PCR_PE(PCR_PE_pe1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT4->PCR[3] = ((PORT4->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT4_3 (pin 24) is configured as P4_3. */
                     | PORT_PCR_MUX(PORT4_PCR3_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
